nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/int/processor/int_p32mk0512mcf064.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _INT_P32MK0512MCF064_H
#define _INT_P32MK0512MCF064_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    INT_ID_0 = 0,
    INT_NUMBER_OF_MODULES = 1

} INT_MODULE_ID;

typedef enum {

    INT_EXTERNAL_INT_SOURCE0 = 0x01,
    INT_EXTERNAL_INT_SOURCE1 = 0x02,
    INT_EXTERNAL_INT_SOURCE2 = 0x04,
    INT_EXTERNAL_INT_SOURCE3 = 0x08,
    INT_EXTERNAL_INT_SOURCE4 = 0x10

} INT_EXTERNAL_SOURCES;

typedef enum {

    INT_DISABLE_INTERRUPT = 0,
    INT_PRIORITY_LEVEL1 = 1,
    INT_PRIORITY_LEVEL2 = 2,
    INT_PRIORITY_LEVEL3 = 3,
    INT_PRIORITY_LEVEL4 = 4,
    INT_PRIORITY_LEVEL5 = 5,
    INT_PRIORITY_LEVEL6 = 6,
    INT_PRIORITY_LEVEL7 = 7

} INT_PRIORITY_LEVEL;

typedef enum {

    INT_SUBPRIORITY_LEVEL0 = 0x00,
    INT_SUBPRIORITY_LEVEL1 = 0x01,
    INT_SUBPRIORITY_LEVEL2 = 0x02,
    INT_SUBPRIORITY_LEVEL3 = 0x03

} INT_SUBPRIORITY_LEVEL;

typedef enum {

    INT_SOURCE_TIMER_CORE = 0,
    INT_SOURCE_SOFTWARE_0 = 1,
    INT_SOURCE_SOFTWARE_1 = 2,
    INT_SOURCE_EXTERNAL_0 = 3,
    INT_SOURCE_TIMER_1 = 4,
    INT_SOURCE_INPUT_CAPTURE_1_ERROR = 5,
    INT_SOURCE_INPUT_CAPTURE_1 = 6,
    INT_SOURCE_OUTPUT_COMPARE_1 = 7,
    INT_SOURCE_EXTERNAL_1 = 8,
    INT_SOURCE_TIMER_2 = 9,
    INT_SOURCE_INPUT_CAPTURE_2_ERROR = 10,
    INT_SOURCE_INPUT_CAPTURE_2 = 11,
    INT_SOURCE_OUTPUT_COMPARE_2 = 12,
    INT_SOURCE_EXTERNAL_2 = 13,
    INT_SOURCE_TIMER_3 = 14,
    INT_SOURCE_INPUT_CAPTURE_3_ERROR = 15,
    INT_SOURCE_INPUT_CAPTURE_3 = 16,
    INT_SOURCE_OUTPUT_COMPARE_3 = 17,
    INT_SOURCE_EXTERNAL_3 = 18,
    INT_SOURCE_TIMER_4 = 19,
    INT_SOURCE_INPUT_CAPTURE_4_ERROR = 20,
    INT_SOURCE_INPUT_CAPTURE_4 = 21,
    INT_SOURCE_OUTPUT_COMPARE_4 = 22,
    INT_SOURCE_EXTERNAL_4 = 23,
    INT_SOURCE_TIMER_5 = 24,
    INT_SOURCE_INPUT_CAPTURE_5_ERROR = 25,
    INT_SOURCE_INPUT_CAPTURE_5 = 26,
    INT_SOURCE_OUTPUT_COMPARE_5 = 27,
    INT_SOURCE_TIMER_6 = 76,
    INT_SOURCE_INPUT_CAPTURE_6_ERROR = 77,
    INT_SOURCE_INPUT_CAPTURE_6 = 78,
    INT_SOURCE_OUTPUT_COMPARE_6 = 79,
    INT_SOURCE_TIMER_7 = 80,
    INT_SOURCE_INPUT_CAPTURE_7_ERROR = 81,
    INT_SOURCE_INPUT_CAPTURE_7 = 82,
    INT_SOURCE_OUTPUT_COMPARE_7 = 83,
    INT_SOURCE_TIMER_8 = 84,
    INT_SOURCE_INPUT_CAPTURE_8_ERROR = 85,
    INT_SOURCE_INPUT_CAPTURE_8 = 86,
    INT_SOURCE_OUTPUT_COMPARE_8 = 87,
    INT_SOURCE_TIMER_9 = 88,
    INT_SOURCE_INPUT_CAPTURE_9_ERROR = 89,
    INT_SOURCE_INPUT_CAPTURE_9 = 90,
    INT_SOURCE_OUTPUT_COMPARE_9 = 91,
    INT_SOURCE_ADC_1 = 92,
    INT_SOURCE_ADC_1_DC1 = 94,
    INT_SOURCE_ADC_1_DC2 = 95,
    INT_SOURCE_ADC_1_DC3 = 245,
    INT_SOURCE_ADC_1_DC4 = 246,
    INT_SOURCE_ADC_1_DF1 = 96,
    INT_SOURCE_ADC_1_DF2 = 97,
    INT_SOURCE_ADC_1_DF3 = 98,
    INT_SOURCE_ADC_1_DF4 = 99,
    INT_SOURCE_ADC_FAULT = 100,
    INT_SOURCE_ADC_1_DATA0 = 106,
    INT_SOURCE_ADC_1_DATA1 = 107,
    INT_SOURCE_ADC_1_DATA2 = 108,
    INT_SOURCE_ADC_1_DATA3 = 109,
    INT_SOURCE_ADC_1_DATA4 = 110,
    INT_SOURCE_ADC_1_DATA5 = 111,
    INT_SOURCE_ADC_1_DATA6 = 112,
    INT_SOURCE_ADC_1_DATA7 = 113,
    INT_SOURCE_ADC_1_DATA8 = 114,
    INT_SOURCE_ADC_1_DATA9 = 115,
    INT_SOURCE_ADC_1_DATA10 = 116,
    INT_SOURCE_ADC_1_DATA11 = 117,
    INT_SOURCE_ADC_1_DATA12 = 118,
    INT_SOURCE_ADC_1_DATA13 = 119,
    INT_SOURCE_ADC_1_DATA14 = 120,
    INT_SOURCE_ADC_1_DATA15 = 121,
    INT_SOURCE_ADC_1_DATA16 = 122,
    INT_SOURCE_ADC_1_DATA17 = 123,
    INT_SOURCE_ADC_1_DATA18 = 124,
    INT_SOURCE_ADC_1_DATA25 = 131,
    INT_SOURCE_ADC_1_DATA26 = 132,
    INT_SOURCE_ADC_1_DATA27 = 133,
    INT_SOURCE_CORE_PERF_COUNT = 254,
    INT_SOURCE_FAST_DEBUG = 255,
    INT_SOURCE_SYSTEM_BUS_PROTECTION = 230,
    INT_SOURCE_SPI_1_ERROR = 35,
    INT_SOURCE_SPI_1_RECEIVE = 36,
    INT_SOURCE_SPI_1_TRANSMIT = 37,
    INT_SOURCE_USART_1_ERROR = 38,
    INT_SOURCE_USART_1_RECEIVE = 39,
    INT_SOURCE_USART_1_TRANSMIT = 40,
    INT_SOURCE_I2C_1_BUS = 41,
    INT_SOURCE_I2C_1_SLAVE = 42,
    INT_SOURCE_I2C_1_MASTER = 43,
    INT_SOURCE_CHANGE_NOTICE_A = 44,
    INT_SOURCE_CHANGE_NOTICE_B = 45,
    INT_SOURCE_CHANGE_NOTICE_C = 46,
    INT_SOURCE_CHANGE_NOTICE_D = 47,
    INT_SOURCE_CHANGE_NOTICE_E = 48,
    INT_SOURCE_CHANGE_NOTICE_F = 49,
    INT_SOURCE_CHANGE_NOTICE_G = 50,
    INT_SOURCE_PARALLEL_PORT = 51,
    INT_SOURCE_PARALLEL_PORT_ERROR = 52,
    INT_SOURCE_COMPARATOR_1 = 32,
    INT_SOURCE_COMPARATOR_2 = 33,
    INT_SOURCE_USB_1 = 34,
    INT_SOURCE_DMA_0 = 72,
    INT_SOURCE_DMA_1 = 73,
    INT_SOURCE_DMA_2 = 74,
    INT_SOURCE_DMA_3 = 75,
    INT_SOURCE_DMA_4 = 182,
    INT_SOURCE_DMA_5 = 183,
    INT_SOURCE_DMA_6 = 184,
    INT_SOURCE_DMA_7 = 185,
    INT_SOURCE_SPI_2_ERROR = 53,
    INT_SOURCE_SPI_2_RECEIVE = 54,
    INT_SOURCE_SPI_2_TRANSMIT = 55,
    INT_SOURCE_USART_2_ERROR = 56,
    INT_SOURCE_USART_2_RECEIVE = 57,
    INT_SOURCE_USART_2_TRANSMIT = 58,
    INT_SOURCE_I2C_2_BUS = 59,
    INT_SOURCE_I2C_2_SLAVE = 60,
    INT_SOURCE_I2C_2_MASTER = 61,
    INT_SOURCE_CAN_1 = 167,
    INT_SOURCE_CAN_2 = 168,
    INT_SOURCE_SPI_3_ERROR = 218,
    INT_SOURCE_SPI_3_RECEIVE = 219,
    INT_SOURCE_SPI_3_TRANSMIT = 220,
    INT_SOURCE_USART_3_ERROR = 62,
    INT_SOURCE_USART_3_RECEIVE = 63,
    INT_SOURCE_USART_3_TRANSMIT = 64,
    INT_SOURCE_I2C_3_BUS = 179,
    INT_SOURCE_I2C_3_SLAVE = 180,
    INT_SOURCE_I2C_3_MASTER = 181,
    INT_SOURCE_SPI_4_ERROR = 221,
    INT_SOURCE_SPI_4_RECEIVE = 222,
    INT_SOURCE_SPI_4_TRANSMIT = 223,
    INT_SOURCE_USART_4_ERROR = 65,
    INT_SOURCE_USART_4_RECEIVE = 66,
    INT_SOURCE_USART_4_TRANSMIT = 67,
    INT_SOURCE_I2C_4_BUS = 194,
    INT_SOURCE_I2C_4_SLAVE = 195,
    INT_SOURCE_SPI_5_ERROR = 224,
    INT_SOURCE_SPI_5_RECEIVE = 225,
    INT_SOURCE_SPI_5_TRANSMIT = 226,
    INT_SOURCE_USART_5_ERROR = 68,
    INT_SOURCE_USART_5_RECEIVE = 69,
    INT_SOURCE_USART_5_TRANSMIT = 70,
    INT_SOURCE_SPI_6_ERROR = 227,
    INT_SOURCE_SPI_6_RECEIVE = 228,
    INT_SOURCE_SPI_6_TRANSMIT = 229,
    INT_SOURCE_USART_6_ERROR = 164,
    INT_SOURCE_USART_6_RECEIVE = 165,
    INT_SOURCE_USART_6_TRANSMIT = 166,
    INT_SOURCE_RTCC = 30,
    INT_SOURCE_FLASH_CONTROL = 31,
    INT_SOURCE_COMPARATOR_3 = 160,
    INT_SOURCE_CTMU = 71,
    INT_SOURCE_I2C_4_MASTER = 196,
    INT_SOURCE_ADC_END_OF_SCAN = 101,
    INT_SOURCE_ADC_ANALOG_CIRCUIT_READY = 102,
    INT_SOURCE_ADC_UPDATE_READY = 103,
    INT_SOURCE_ADC_GROUP = 105,
    INT_SOURCE_DATA_EEPROM = 186,
    INT_SOURCE_ADC_DMA = 104,
    INT_SOURCE_ADC_1_DATA48 = 154,
    INT_SOURCE_ADC_1_DATA49 = 155,
    INT_SOURCE_ADC_1_DATA50 = 156,
    INT_SOURCE_ADC_1_DATA51 = 157,
    INT_SOURCE_ADC_1_DATA52 = 158,
    INT_SOURCE_ADC_1_DATA53 = 159,
    INT_SOURCE_COMPARATOR_4 = 161,
    INT_SOURCE_COMPARATOR_5 = 162,
    INT_SOURCE_CAN_3 = 187,
    INT_SOURCE_CAN_4 = 188,
    INT_SOURCE_INPUT_CAPTURE_10_ERROR = 197,
    INT_SOURCE_INPUT_CAPTURE_10 = 198,
    INT_SOURCE_OUTPUT_COMPARE_10 = 199,
    INT_SOURCE_INPUT_CAPTURE_11_ERROR = 200,
    INT_SOURCE_INPUT_CAPTURE_11 = 201,
    INT_SOURCE_OUTPUT_COMPARE_11 = 202,
    INT_SOURCE_INPUT_CAPTURE_12_ERROR = 203,
    INT_SOURCE_INPUT_CAPTURE_12 = 204,
    INT_SOURCE_OUTPUT_COMPARE_12 = 205,
    INT_SOURCE_INPUT_CAPTURE_13_ERROR = 206,
    INT_SOURCE_INPUT_CAPTURE_13 = 207,
    INT_SOURCE_OUTPUT_COMPARE_13 = 208,
    INT_SOURCE_INPUT_CAPTURE_14_ERROR = 209,
    INT_SOURCE_INPUT_CAPTURE_14 = 210,
    INT_SOURCE_OUTPUT_COMPARE_14 = 211,
    INT_SOURCE_INPUT_CAPTURE_15_ERROR = 212,
    INT_SOURCE_INPUT_CAPTURE_15 = 213,
    INT_SOURCE_OUTPUT_COMPARE_15 = 214,
    INT_SOURCE_INPUT_CAPTURE_16_ERROR = 215,
    INT_SOURCE_INPUT_CAPTURE_16 = 216,
    INT_SOURCE_OUTPUT_COMPARE_16 = 217,
    INT_SOURCE_QEI1 = 169,
    INT_SOURCE_QEI2 = 170,
    INT_SOURCE_QEI3 = 189,
    INT_SOURCE_QEI4 = 190,
    INT_SOURCE_QEI5 = 191,
    INT_SOURCE_QEI6 = 192,
    INT_SOURCE_PWM_PRIMARY = 171,
    INT_SOURCE_PWM_SECONDARY = 172,
    INT_SOURCE_PWM1 = 173,
    INT_SOURCE_PWM2 = 174,
    INT_SOURCE_PWM3 = 175,
    INT_SOURCE_PWM4 = 176,
    INT_SOURCE_PWM5 = 177,
    INT_SOURCE_PWM6 = 178,
	INT_SOURCE_PWM7 = 238,
    INT_SOURCE_PWM8 = 239,
    INT_SOURCE_PWM9 = 240,
    INT_SOURCE_PWM10 = 241,
    INT_SOURCE_PWM11 = 242,
    INT_SOURCE_PWM12 = 243

} INT_SOURCE;

